# Before you start :
   - These exercises are related to the Pivot table and correlation lessons.
   - Keep in mind that you need to use some of the functions you learned in the previous lessons.
   - All datasets are provided in the `your-code` folder of this lab.
   - Elaborate your codes and outputs as much as you can.
   - Try your best to answer the questions and complete the tasks and most importantly enjoy the process!!!

#### Import all the libraries that are necessary.

In [2]:
import pandas as pd
import numpy as np

#### Open the ` Employee.csv` file and name your dataset `employee`.

In [3]:
employee = pd.read_csv('/Users/Hector_Martin/Documents/Labs/lab-pivot-table-and-correlation/your_code/data/Employee.csv')
display(employee.head())

     Name Department Education Gender      Title  Years  Salary
0    Jose         IT  Bachelor      M    analyst      1      35
1   Maria         IT    Master      F    analyst      2      30
2   David         HR    Master      M    analyst      2      30
3   Sonia         HR  Bachelor      F    analyst      4      35
4  Samuel      Sales    Master      M  associate      3      55

#### What's the mean salary by department?
Hint : There are 2 ways to do it - one way is with groupby and the other way is with pivot tables. Do it both ways.

**Group by:**

In [5]:
display(employee.groupby(['Department'])[['Salary']].agg(np.mean))

            Salary
Department
HR           45.00
IT           48.75
Sales        55.00

**Pivot Table:**

In [6]:
display(employee.pivot_table(index=['Department'], values = ['Salary'], aggfunc = ['mean']))

             mean
           Salary
Department
HR          45.00
IT          48.75
Sales       55.00

#### We want now to group the data by more than one column. Use Pandas pivot table function to select the mean salary by department and title.

**Pivot Table:**

In [7]:
display(employee.pivot_table(index=['Department', 'Title'], values = ['Salary'], aggfunc = ['mean']))

                       mean
                     Salary
Department Title
HR         VP          70.0
           analyst     32.5
IT         VP          70.0
           analyst     32.5
           associate   60.0
Sales      associate   55.0

**Group by:**

In [9]:
display(employee.groupby(['Department', 'Title'])[['Salary']].agg(np.mean))

                      Salary
Department Title
HR         VP           70.0
           analyst      32.5
IT         VP           70.0
           analyst      32.5
           associate    60.0
Sales      associate    55.0

#### We want to display the number of years of work experience and the salary for each Title. Add Years as a column in your pivot table.
*Hint: Use Pandas doc(see References in README.md) to explore the pivot_table() arguments*

In [10]:
display(employee.pivot_table(index=['Title'], values = ['Years','Salary']))

              Salary  Years
Title
VP         70.000000   8.00
analyst    32.500000   2.25
associate  56.666667   4.00

#### We want to know the information about the mean salary and number of employees in each department and for each job title.

In [11]:
display(employee.pivot_table(index=['Department','Title'], values = ['Salary', 'Name'], aggfunc = {'Salary':'mean','Name':'count'}))

                      Name  Salary
Department Title
HR         VP            1    70.0
           analyst       2    32.5
IT         VP            1    70.0
           analyst       2    32.5
           associate     1    60.0
Sales      associate     2    55.0

#### We want to know for each department and for each job title the Salary's median, minimum, maximum and standard deviation. Comment your results.

In [12]:
agg_emp = employee.pivot_table(index=['Department','Title'], values = ['Salary'], aggfunc = [np.median, np.min, np.max, np.std]).reset_index()
display(agg_emp)

  Department      Title median   amin   amax       std
                        Salary Salary Salary    Salary
0         HR         VP   70.0     70     70       NaN
1         HR    analyst   32.5     30     35  3.535534
2         IT         VP   70.0     70     70       NaN
3         IT    analyst   32.5     30     35  3.535534
4         IT  associate   60.0     60     60       NaN
5      Sales  associate   55.0     55     55  0.000000

In [13]:
agg_emp.isna().sum()

Department            0
Title                 0
median      Salary    0
amin        Salary    0
amax        Salary    0
std         Salary    3
dtype: int64

All values seem to be displayed correctly except for the Standard Deviation column.

#### Based on your comments, fill the missing values with an appropriate value.

I filled the NaN values with the Standard Deviation of the Salary again.

In [9]:
display(agg_emp.fillna(np.std(agg_emp['std','Salary'])))

  Department      Title median   amin   amax       std
                        Salary Salary Salary    Salary
0         HR         VP   70.0     70     70  1.666667
1         HR    analyst   32.5     30     35  3.535534
2         IT         VP   70.0     70     70  1.666667
3         IT    analyst   32.5     30     35  3.535534
4         IT  associate   60.0     60     60  1.666667
5      Sales  associate   55.0     55     55  0.000000

  Department      Title median   amin   amax       std
                        Salary Salary Salary    Salary
0         HR         VP   70.0     70     70  1.666667
1         HR    analyst   32.5     30     35  3.535534
2         IT         VP   70.0     70     70  1.666667
3         IT    analyst   32.5     30     35  3.535534
4         IT  associate   60.0     60     60  1.666667
5      Sales  associate   55.0     55     55  0.000000

In [10]:
#this is just to try how to navigate within multiindex Dataframes, it seems that I got it.
agg_emp[{'median':'Salary', 'amax':'Salary' }]

  median   amax
  Salary Salary
0   70.0     70
1   32.5     35
2   70.0     70
3   32.5     35
4   60.0     60
5   55.0     55

#### The stakeholders want to know for each department the number of employees and how much money is spend on salaries. Could you provide that information?

In [14]:
employee.pivot_table(index=['Department'], values = ['Name', 'Salary'], aggfunc = {'Salary':'sum','Name':'count'})

            Name  Salary
Department
HR             3     135
IT             4     195
Sales          2     110

#### For each Department and Title, we want to know the the total years of work experience and the mean salary.

In [12]:
employee.head()

     Name Department Education Gender      Title  Years  Salary
0    Jose         IT  Bachelor      M    analyst      1      35
1   Maria         IT    Master      F    analyst      2      30
2   David         HR    Master      M    analyst      2      30
3   Sonia         HR  Bachelor      F    analyst      4      35
4  Samuel      Sales    Master      M  associate      3      55

In [15]:
employee.pivot_table(index=['Department', 'Title'], values = ['Years', 'Salary'], aggfunc = {'Years':'sum','Salary':'mean'}).reset_index()

  Department      Title  Salary  Years
0         HR         VP    70.0      8
1         HR    analyst    32.5      6
2         IT         VP    70.0      8
3         IT    analyst    32.5      3
4         IT  associate    60.0      7
5      Sales  associate    55.0      5